from dotenv import load_dotenv
import os

load_dotenv()

BOT_TOKEN = os.getenv('BOT_TOKEN')
SAVE_DIR = "images"
WEBHOOK_PATH = os.getenv('WEBHOOK_PATH')
WEBHOOK_URL = os.getenv('WEBHOOK_URL')

WELCOME_MESSAGE = """
👋 Привет! Я — Anomaly Detection Bot.

С помощью меня ты можешь:
🖌 Нарисовать изображение прямо здесь.
🧠 Я проанализирую его нейросетью и выделю все аномальные области (например, квадраты среди кругов) цветом.
📥 После обработки ты получишь обратно изображение с подсветкой аномалий.

Чтобы начать, нажми кнопку «Draw».
"""